# Created by moeheart at 10/11/2020
# 全局用到的部分常量。

EDITION = "8.2.3beta"
ANNOUNCEMENT = "8.2版本已发布，包括多项重要的内容，请及时更新！如果遇到bug，速向开发者反馈。另外，前端需要一段时间才能更新完毕。"
IP = "120.48.95.56"
# IP = "139.199.102.41"
CHAPTER = 120

LVLTABLE = [0, 30, 100, 200, 300, 500, 700, 900, 1200, 1500, 1800, 2400, 3000, 999999]
LVLNAME = ["二级警员", "一级警员", "三级警司", "二级警司", "一级警司", "三级警督", "二级警督", "一级警督", "三级警监", "二级警监", "一级警监", "副总警监", "总警监", "最高等级"]

INTERRUPT_DICT = {
    "240": "抢珠式",
    "370": "八卦洞玄",
    "310": "剑飞惊天",
    "14975": "万剑归宗",  # 伤害技能
    "183": "厥阴指",
    "482": "崩",
    "547": "剑心通明",
    "2716": "剑破虚空",  # 仅主目标，2988是子目标，不附带打断
    "1577": "玉虹贯日",
    "1909": "平湖断月",  # ？
    "18584": "灵蛊",
    "2461": "蟾啸",  # 打断子技能，之前的蟾啸迷心
    "3092": "梅花针",
    "3961": "寒月耀",
    "5259": "棒打狗头",
    "13396": "盾飞",  # 打断子技能
    "14095": "清音长啸",
    #"16598": "雷走风切",
    "17364": "雷走风切",  # 非大刀雷走实际打断，推测
    "16632": "雷走风切",  # 大刀雷走实际打断
    "20065": "翔极碧落",
    "22640": "血覆黄泉",  # 打断子技能
    "25011": "神皆寂",
    "28377": "惊鸿掠水",  # 打断子技能
}

COLOR_DICT = {"0": (0, 0, 0),  # 未知
             "1": (210, 180, 0),  # 少林
             "2": (127, 31, 223),  # 万花
             "4": (56, 175, 255),  # 纯阳
             "5": (255, 127, 255),  # 七秀
             "3": (160, 0, 0),  # 天策
             "8": (220, 220, 0),  # 藏剑
             "9": (205, 133, 63),  # 丐帮
             "10": (253, 84, 0),  # 明教
             "6": (63, 31, 159),  # 五毒
             "7": (0, 133, 144),  # 唐门
             "21": (180, 60, 0),  # 苍云
             "22": (100, 250, 180),  # 长歌
             "23": (71, 73, 166),  # 霸刀
             "24": (195, 171, 227),  # 蓬莱
             "25": (161, 9, 34),  # 凌雪
             "211": (166, 83, 251),  # 衍天
             "212": (0, 172, 153),  # 药宗
             "213": (107, 183, 242),  # (64, 101, 169),  # 刀宗
             }
