# Created by moeheart at 10/17/2021
# 实现BOSS名称与地图名称的各种转化。

BOSS_RAW = {"未知": [0, 1, []],
            "铁黎": [1, 1, []],
            "陈徽": [1, 2, []],
            "藤原武裔": [1, 3, []],
            "源思弦": [1, 4, ["咒飚狐", "咒凌狐", "咒狐"]],
            "驺吾": [1, 5, []],
            "方有崖": [1, 6, []],
            "周贽_范阳夜变": [2, 1, ["狼牙精锐", "狼牙刀盾兵"]],
            "厌夜": [2, 2, []],
            "迟驻": [2, 3, []],
            "白某": [2, 4, ["少阴符灵", "少阳符灵"]],
            "安小逢": [2, 5, ["狼牙斧卫", "水鬼"]],
            "余晖": [3, 1, []],
            "宓桃": [3, 2, ["天欲宫弟子", "天欲宫男宠"]],
            "武雪散": [3, 3, []],
            "猿飞": [3, 4, []],
            "哑头陀": [3, 5, ["毗流驮迦", "毗留博叉", "充能核心", "提多罗吒", "毗沙门"]],
            "岳琳&岳琅": [3, 6, ["岳琳", "岳琅", "蜂群毛贼", "蜂群蟊贼", "蜂群凶贼", "蜂群胖墩"]],
            "胡汤&罗芬": [4, 1, ["胡汤", "罗芬"]],
            "赵八嫂": [4, 2, []],
            "海荼": [4, 3, ["天怒惊霆戟", "水鬼"]],
            "姜集苦": [4, 4, []],
            "宇文灭": [4, 5, []],
            "宫威": [4, 6, []],
            "宫傲": [4, 7, []],
            "修罗僧": [5, 7, []],
            "巨型尖吻凤": [6, 1, ["巨型尖吻鳳"]],
            "桑乔": [6, 2, ["桑喬"]],
            "悉达罗摩": [6, 3, ["蛊兽", "悉達羅摩"]],
            "尤珈罗摩": [6, 4, ["赐恩血瘤", "血蛊巢心", "賜恩血瘤"]],
            "月泉淮old": [6, 5, []],
            "乌蒙贵": [6, 6, ["黑条巨蛾", "黑條巨蛾", "烏蒙貴"]],
            "勒齐那": [7, 1, ["勒齊那"]],
            "阿阁诺": [7, 2, ["阿閣諾"]],
            "周通忌": [7, 3, []],
            "周贽": [7, 4, ["周贄", "狼牙精锐", "狼牙精銳", "李秦授"]],
            "常宿": [7, 5, []],
            "张景超": [8, 1, ["張景超", "张法雷", "張法雷"]],
            "刘展": [8, 2, ["劉展", "枪卫首领", "槍衛首領", "斧卫首领", "斧衛首領"]],
            "苏凤楼": [8, 3, ["蘇鳳樓", "凌雪阁杀手", "淩雪閣殺手", "剧毒孢子", "劇毒孢子"]],
            "韩敬青": [8, 4, ["韓敬青"]],
            "藤原佑野": [8, 5, []],
            "李重茂": [8, 6, ["永王叛军长枪兵", "一刀流精锐武士", "永王叛军剑卫", "永王叛軍長槍兵", "一刀流精銳武士",
                              "永王叛軍劍衛"]],
            "时风": [9, 1, ["時風"]],
            "乐临川": [9, 2, ["樂臨川"]],
            "牛波": [9, 3, ["黑熊", "恶虎", "巨象", "惡虎"]],
            "和正": [9, 4, []],
            "武云阙": [9, 5, ["武雲闕"]],
            "翁幼之": [9, 6, []],
            "魏华": [10, 1, ["魏華"]],
            "钟不归": [10, 2, ["鐘不歸"]],
            "岑伤": [10, 3, ["岑傷"]],
            "鬼筹": [10, 4, ["鬼籌"]],
            "麒麟": [10, 5, []],
            "月泉淮": [10, 6, []],
            "葛木寒": [11, 1, []],
            "雨轻红": [11, 2, ["雨輕紅"]],
            "喜雅": [11, 3, []],
            "鹰眼客": [11, 4, []],
            "赤幽明": [11, 5, ["赤厄明"]],
            "骆耀阳": [12, 1, ["駱耀陽"]],
            "韦柔丝": [12, 2, ["韋柔絲"]],
            "宋泉": [12, 3, []],
            "伍靖远": [12, 4, ["伍靖遠"]],
            "苏什": [12, 5, ["蘇什"]],
            "芭德": [12, 6, []],
            "邢廷恩": [13, 1, ["马英俊", "朱光辉", "馬英俊", "朱光輝"]],
            "许灵素": [13, 2, ["天灵卫", "地灵卫", "許靈素", "天靈衛", "地靈衛"]],
            "侯青": [13, 3, ["弓卫", "弓衛"]],
            "李系": [13, 4, []],
            "年勒": [13, 5, []],
            "杨玉环": [13, 6, ["楊玉環"]],
            "池清川": [14, 1, ["白蛟", "黑蛟"]],
            "李倓": [14, 2, []],
            "巴图仁钦": [15, 1, ["巴圖仁欽"]],
            "竭勒": [15, 2, ["竭勒"]],
            "图南子": [15, 3, ["圖南子"]],
            "叶葵": [15, 4, ["葉葵"]],
            "尹雪尘": [15, 5, ["尹雪塵"]],
            "阿里曼幻身": [16, 1, ["阿里曼幻身"]],
            "阿萨辛": [16, 2, ["阿薩辛"]],
            }

MAP_NAME_LIST = ["未知地图",  # 0
                 "敖龙岛",  # 1
                 "范阳夜变",  # 2
                 "达摩洞",  # 3
                 "白帝江关",  # 4
                 "修罗挑战",  # 5
                 "雷域大泽",  # 6
                 "河阳之战",  # 7
                 "西津渡",  # 8
                 "武狱黑牢",  # 9
                 "九老洞",  # 10
                 "冷龙峰",  # 11
                 "一之窟",  # 12
                 "太极宫",  # 13
                 "空城殿",  # 14
                 "会战弓月城",  # 15
                 "缚罪之渊",  # 16
                 ]

# 地图ID, logs得分系数, 别名
MAP_RAW = {"未知地图": [0, 0, [], "未知版本", "0-0"],
           "敖龙岛": [426, 0, [], "", "100-3"],
           "范阳夜变": [452, 0, [], "结庐在江湖", "100-4"],
           "达摩洞": [482, 0, [], "奉天证道", "110-1"],
           "白帝江关": [518, 0, [], "白帝风云", "110-2"],
           "修罗挑战": [0, 0, [], "修罗挑战", "0-0"],
           "雷域大泽": [559, 0, ["雷域大澤"], "北天药宗", "110-3"],
           "河阳之战": [573, 0, ["河陽之戰"], "江湖无限", "110-4"],
           "西津渡": [586, 0, [], "横刀断浪", "120-1"],
           "武狱黑牢": [636, 0, ["武獄黑牢"], "群侠万变", "120-2"],
           "九老洞": [648, 0, [], "万灵当歌", "120-3"],
           "冷龙峰": [668, 0, [], "雾海寻龙", "120-4"],
           "一之窟": [686, 0, [], "丝路风语", "130-1"],
           "太极宫": [706, 1, ["太極宮"], "太极秘录", "130-2"],
           "空城殿": [710, 5, ["25人挑戰空城殿·上", "25人挑戰空城殿·下", "25人挑战空城殿·上", "25人挑战空城殿·下"], "太极秘录", "130-2"],
           "会战弓月城": [722, 1, ["會戰弓月城"], "山海源流", "130-3"],
           "缚罪之渊": [720, 6, ["縛罪之淵"], "山海源流", "130-3"],
           }

# 版本号，涉及的地图，合理的时间范围（开始时间戳，结束时间戳）
# https://www.epochconverter.com/
GAMEEDITION_RAW = {
    "0": ["未知版本", ["0"], [[0, 2147483647]]],
    "100": ["万灵当歌（初版）", ["648", "649", "650"], [[0, 1701043200]]],
    "101": ["万灵当歌（一削）", ["648", "649", "650"], [[1701043200, 1704672000]]],
    "102": ["万灵当歌（二削）", ["648", "649", "650"], [[1704672000, 1705536000], [1708560000, 2147483647]]],
    "103": ["万灵当歌（大阵）", ["648", "649", "650"], [[1705536000, 1708560000]]],
    "110": ["雾海寻龙（体服）", ["668", "669", "670"], [[0, 1713999600]]],
    "111": ["雾海寻龙（初版）", ["668", "669", "670"], [[1713999600, 1716764400]]],
    "112": ["雾海寻龙（一削）", ["668", "669", "670"], [[1716764400, 2147483647]]],
    "120": ["丝路风语（体服）", ["686", "687", "688"], [[0, 1729724400]]],
    "121": ["丝路风语（体服后期）", ["686", "687", "688"], [[1729724400, 1730422800]]],
    "122": ["丝路风语（初版）", ["686", "687", "688"], [[1730422800, 1734314400]]],
    "123": ["丝路风语（一削）", ["686", "687", "688"], [[1734314400, 2147483647]]],
    "130": ["太极密录（体服）", ["706", "707", "708", "710", "711"], [[0, 1744844400]]],
    "131": ["太极密录（初版）", ["706", "707", "708", "710", "711"], [[1744844400, 1747609200]]],
    "132": ["太极密录（一削）", ["706", "707", "708", "710", "711"], [[1747609200, 2147483647]]],
    "140": ["山海源流（体服）", ["722", "723", "724"], [[0, 1761177600]]],
    "141": ["山海源流（体服2）", ["722", "723", "724"], [[1761177600, 1761782400]]],
    "142": ["山海源流（初版）", ["722", "723", "724"], [[1761782400, 1765148400]]],
    "143": ["山海源流（一削）", ["722", "723", "724", "720"], [[1765148400, 2147483647]]],
}

BOSS_DICT = {}
MAP_DICT = {}
NICK_TO_BOSS = {}

for line in BOSS_RAW:
    MAP_DICT[line] = BOSS_RAW[line][0]
    BOSS_DICT[line] = BOSS_RAW[line][1]
    NICK_TO_BOSS[line] = line
    for otherName in BOSS_RAW[line][2]:
        MAP_DICT[otherName] = BOSS_RAW[line][0]
        BOSS_DICT[otherName] = BOSS_RAW[line][1]
        NICK_TO_BOSS[otherName] = line


# def getBossDictFromMap(map):
#     if map == "敖龙岛":
#         bossDict = {"铁黎": 1, "陈徽": 2, "藤原武裔": 3, "源思弦": 4, "驺吾": 5, "方有崖": 6}
#         bossDictR = ["", "铁黎", "陈徽", "藤原武裔", "源思弦", "驺吾", "方有崖"]
#     elif map == "范阳夜变":
#         bossDict = {"周贽": 1, "厌夜": 2, "迟驻": 3, "白某": 4, "安小逢": 5}
#         bossDictR = ["", "周贽", "厌夜", "迟驻", "白某", "安小逢"]
#     elif map == "达摩洞":
#         bossDict = {"余晖": 1, "宓桃": 2, "武雪散": 3, "猿飞": 4, "哑头陀": 5, "岳琳&岳琅": 6}
#         bossDictR = ["", "余晖", "宓桃", "武雪散", "猿飞", "哑头陀", "岳琳&岳琅"]
#     elif map == "白帝江关":
#         bossDict = {"胡汤&罗芬": 1, "赵八嫂": 2, "海荼": 3, "姜集苦": 4, "宇文灭": 5, "宫威": 6, "宫傲": 7}
#         bossDictR = ["", "胡汤&罗芬", "赵八嫂", "海荼", "姜集苦", "宇文灭", "宫威", "宫傲"]
#     elif map == "修罗挑战":
#         bossDict = {"修罗僧": 1}
#         bossDictR = ["", "修罗僧"]
#     elif map == "雷域大泽":
#         bossDict = {"巨型尖吻凤": 1, "桑乔": 2, "悉达罗摩": 3, "尤珈罗摩": 4, "月泉淮": 5, "乌蒙贵": 6}
#         bossDictR = ["", "巨型尖吻凤", "桑乔", "悉达罗摩", "尤珈罗摩", "月泉淮", "乌蒙贵"]
#     else:
#         bossDict = {}
#         bossDictR = [""]
#     return bossDict, bossDictR

def getNickToBoss(nick):
    if nick in NICK_TO_BOSS:
        return NICK_TO_BOSS[nick]
    else:
        return nick


def getGameEditionFromTime(map, time):
    for key in GAMEEDITION_RAW:
        line = GAMEEDITION_RAW[key]
        if map in line[1]:
            for period in line[2]:
                if time >= period[0] and time < period[1]:
                    return key
    return "0"


MAP_DICT = {}
MAP_ORIGINAL = {}
MAP_DICT_REVERSE = {}
MAP_TRADITIONAL = {}
MAP_DICT_RECORD_LOGS = {}

for map in MAP_RAW:
    if MAP_RAW[map][0] != 0:
        mapid = MAP_RAW[map][0]
        if MAP_RAW[map][1] == 5:
            MAP_DICT[str(mapid)] = "25人挑战%s·上" % map
            MAP_DICT[str(mapid + 1)] = "25人挑战%s·下" % map
            MAP_ORIGINAL[str(mapid)] = map
            MAP_ORIGINAL[str(mapid + 1)] = map
        elif MAP_RAW[map][1] != 6:
            MAP_DICT[str(mapid)] = "10人普通%s" % map
            MAP_DICT[str(mapid + 1)] = "25人普通%s" % map
            MAP_DICT[str(mapid + 2)] = "25人英雄%s" % map
            MAP_ORIGINAL[str(mapid)] = map
            MAP_ORIGINAL[str(mapid + 1)] = map
            MAP_ORIGINAL[str(mapid + 2)] = map
        else:
            MAP_DICT[str(mapid)] = map
            MAP_ORIGINAL[str(mapid)] = map
        if MAP_RAW[map][1] == 1:
            MAP_DICT_RECORD_LOGS[str(mapid)] = int(MAP_RAW[map][1])
            MAP_DICT_RECORD_LOGS[str(mapid + 1)] = int(MAP_RAW[map][1] * 2)
            MAP_DICT_RECORD_LOGS[str(mapid + 2)] = int(MAP_RAW[map][1] * 4)
        MAP_DICT_REVERSE[map] = str(mapid)
        if MAP_RAW[map][1] == 5:
            MAP_DICT_RECORD_LOGS[str(mapid)] = int(MAP_RAW[map][1])
            MAP_DICT_REVERSE["25人挑战%s·上" % map] = str(mapid)
            MAP_DICT_REVERSE["25人挑战%s·下" % map] = str(mapid + 1)
        elif MAP_RAW[map][1] != 6:
            MAP_DICT_RECORD_LOGS[str(mapid)] = int(MAP_RAW[map][1])
            MAP_DICT_REVERSE["10人普通%s" % map] = str(mapid)
            MAP_DICT_REVERSE["25人普通%s" % map] = str(mapid + 1)
            MAP_DICT_REVERSE["25人英雄%s" % map] = str(mapid + 2)
        else:
            MAP_DICT_REVERSE[map] = str(mapid)
        for map_othername in MAP_RAW[map][2]:
            MAP_TRADITIONAL[map_othername] = map
            MAP_TRADITIONAL["10人普通%s" % map_othername] = "10人普通%s" % map
            MAP_TRADITIONAL["25人普通%s" % map_othername] = "25人普通%s" % map
            MAP_TRADITIONAL["25人英雄%s" % map_othername] = "25人英雄%s" % map


def getMapFromID(map):
    '''
    从地图ID获取地图名字符串。
    params:
    - map: 地图ID
    returns:
    - res: 地图对应的中文字符串.
    '''
    if map in MAP_DICT:
        return MAP_DICT[map]
    else:
        return "未知"

def getAllMapInfoFromID(map):
    '''
    从地图ID获取所有信息。
    params:
    - map: 地图ID
    returns:
    - res: 地图对应的名字、版本信息、版本编号
    '''
    if map in MAP_ORIGINAL:
        mapName = MAP_ORIGINAL[map]
        mapFullName = MAP_DICT[map]
        mapVersion = MAP_RAW[mapName][3]
        mapCode = MAP_RAW[mapName][4]
        return {"name": mapFullName, "version": mapVersion, "code": mapCode}
    elif map in MAP_DICT:
        return {"name": MAP_DICT[map], "version": "未知版本", "code": "0-0"}
    else:
        return {"name": "未知地图", "version": "未知版本", "code": "0-0"}



def getIDFromMap(map):
    '''
    根据地图字符串获取地图ID。
    params:
    - map: 地图对应的中文字符串
    returns:
    - res: 地图ID.
    '''

    if map in MAP_DICT_REVERSE:
        return MAP_DICT_REVERSE[map]
    else:
        return "未知"






